espressif/esp-gmf/packages/esp_player/test_apps/sdkconfig.defaults.esp32p4
# ESP32-P4 specific defaults for esp_player test
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_64B=y
CONFIG_FATFS_VOLUME_COUNT=10
CONFIG_FREERTOS_USE_LIST_DATA_INTEGRITY_CHECK_BYTES=y
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512

# See gmf_core/test_apps/sdkconfig.defaults.esp32p4 for rationale: route console
# over USB-Serial-JTAG so pytest-embedded's writes to /dev/ttyACM0 reach the unity menu.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

#
# Wi-Fi Remote (esp_hosted + esp_wifi_remote, for P4 without built-in WiFi)
#
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y
CONFIG_EXAMPLE_CONNECT_WIFI=y
